old/app/controllers/histories_controller.rb

      lineageForNewPeopleIds = Hash.new
      newPeopleIds.each{ |id| lineageForNewPeopleIds[id.to_i] = [id] }
      while !newPeopleIds.empty?
        newPeople = Individual.find(newPeopleIds)
---
SELECT * FROM `individuals` WHERE (full_name LIKE '%trent%') ORDER BY full_name